{
  "game": "Checkers",
  "rules": [
    {
      "id": 1,
      "title": "Objective",
      "description": "The objective of the game is to capture all of your opponent's pieces or block them so they cannot move."
    },
    {
      "id": 2,
      "title": "Starting Position",
      "description": "Each player begins with 12 pieces placed on the dark squares of the first three rows closest to them on an 8x8 board."
    },
    {
      "id": 3,
      "title": "Movement",
      "description": "Pieces can only move diagonally forward to an adjacent dark square that is not occupied."
    },
    {
      "id": 4,
      "title": "Capturing",
      "description": "If an opponent's piece is adjacent to yours and there is an empty square directly behind it, you must jump over the opponent's piece and capture it."
    },
    {
      "id": 5,
      "title": "King Pieces",
      "description": "When a piece reaches the opponent's back row, it becomes a King. Kings can move and capture diagonally both forward and backward."
    },
    {
      "id": 6,
      "title": "Winning the Game",
      "description": "The game ends when one player captures all of the opponent's pieces or blocks all their moves."
    },
    {
      "id": 7,
      "title": "Forced Captures",
      "description": "If a player can make a capture, they are required to do so. If multiple captures are available, the player can choose which to execute."
    },
    {
      "id": 8,
      "title": "Double Jumps",
      "description": "If, after capturing a piece, the same piece can make another capture, the player must continue jumping with that piece until no more captures are possible."
    },
    {
      "id": 9,
      "title": "Draws",
      "description": "If neither player can force a win, the game is declared a draw."
    }
  ],
  "additional_notes": [
        "Checkers is also known as Draughts in some countries.",
        "The official rules may vary slightly depending on the version or organization."
    ]
}