{
  "platformInfo": {
    "platformName": "GameHive",
    "description": "GameHive is your premier platform for selecting, playing, and mastering board and strategy games with friends or online opponents.",
    "navigation": {
      "homePage": {
        "description": "Start your journey by selecting a game to play.",
        "features": [
          "Browse all available games.",
          "Identify free games and games requiring purchase.",
          "Quick access to your favorite games."
        ]
      },
      "gameLibrary": {
        "description": "Explore the full catalog of games.",
        "features": [
          "View detailed game information including rules and achievements.",
          "Purchase games securely with supported payment options.",
          "Search and filter games by category or popularity."
        ]
      },
      "profilePage": {
        "description": "Manage your account and personal settings.",
        "features": [
          "Edit your bio and upload a profile picture.",
          "Update login credentials like email and password.",
          "View your game achievements and progress.",
          "Mark games or friends as favorites for quick access."
        ]
      },
      "friendSystem": {
        "description": "Connect with other players on the platform.",
        "features": [
          "Search for users by username and send friend requests.",
          "View a list of your friends and their profiles.",
          "Track your stats against each friend, including wins and losses."
        ]
      },
      "scoreboards": {
        "description": "Compare your performance with other players.",
        "features": [
          "View detailed stats for each game you play.",
          "Track your global and friend-only rankings.",
          "Set goals to climb the leaderboards."
        ]
      },
      "matchHistory": {
        "description": "Review all matches you've played.",
        "features": [
          "View detailed data for each match, including opponents and outcomes.",
          "Filter matches by date, game, or result.",
          "Analyze past matches to improve your strategy."
        ]
      },
      "gameLobby": {
        "description": "Prepare for your next match.",
        "features": [
          "Invite friends from your friend list to a private match.",
          "Match with a random online opponent.",
          "Start playing once another player joins."
        ]
      }
    },
    "featuresOverview": {
      "gameAchievements": {
        "description": "Unlock achievements to show your mastery.",
        "features": [
          "Achievements are specific to each game.",
          "See unlocked and locked achievements.",
          "Track progress and learn how to unlock remaining achievements."
        ]
      },
      "favoriteGamesAndFriends": {
        "description": "Quickly access your favorites.",
        "features": [
          "Mark games as favorites for faster selection.",
          "Mark friends as favorites to prioritize interactions.",
          "Access your favorite games and friends from your profile page."
        ]
      },
      "gamePlay": {
        "description": "Enjoy seamless matches with friends or online opponents.",
        "features": [
          "Play free games or purchased ones.",
          "Engage in private matches or public matchmaking.",
          "Experience high-quality gameplay with detailed match data."
        ]
      }
    },
    "quickTips": {
      "gettingStarted": "Start from the home page to select and play a game.",
      "editingProfile": "Go to your profile page to customize your bio, picture, and login details.",
      "addingFriends": "Use the friend system to search for users and send friend requests.",
      "unlockingAchievements": "Check the achievements page of each game to track progress and unlocking criteria.",
      "purchasingGames": "Look for games marked as 'premium' in the game library and follow the purchase process."
    }
  }
}
